# Найти сумму чисел ряда 1,2,3,...,60 с использованием функции
# нахождения суммы. Использовать локальные переменные.

def sum1():
    a = sum(range(1, 61))
    print(a)


sum1()

